[
  {
    "id": 1,
    "title": "Kasa",
    "description": "Refonte d'un site de location d'appartements",
    "image": { "src": "/images/Kasa-logo.webp", "alt": "Logo de kasa" },
    "project_id": "projet-1",
    "details": {
      "pictures": [
        { "src": "/images/Kasa-home.webp", "alt": "Page d'accueil de kasa" },
        { "src": "/images/Kasa-about.webp", "alt": "Page à propos de kasa" },
        { "src": "/images/Kasa-location.webp", "alt": "Page de location d'un apparetement de kasa" }
      ],
      "scenario": "Kasa est une plateforme de location d’appartements entre particuliers. Le site, développé il y a plus de 10 ans en ASP.NET, devait être modernisé avec une stack JavaScript complète. En tant que développeur front-end freelance, j’ai été chargé de créer la nouvelle interface en React, en suivant des maquettes Figma responsives, et en utilisant un fichier JSON mocké en attendant le back-end.",
      "roles": [
        "Initialiser le projet avec Vite + React.",
        "Mettre en place les routes avec React Router.",
        "Créer les composants principaux : Header, Footer, Gallery, Collapse, pages d’erreur, etc.",
        "Intégrer les maquettes Figma en responsive design (mobile et desktop).",
        "Respecter les contraintes fonctionnelles fournies par le designer."
      ],
      "features": [
        "Page d’accueil avec liste des appartements.",
        "Page d’un appartement avec galerie photos, description, équipements, avis et hôte.",
        "Collapse interactif : fermés par défaut, ouverture/fermeture au clic.",
        "Page d’erreur 404."
      ],
      "technologies": [
        "React(Vite, React Router)",
        "JavaScript (ES6+)",
        "HTML5 / CSS3 (Sass)",
        "Figma"
      ],
      "link": "https://github.com/corsarto/kasa.git"
    }
  },
  {
    "id": 2,
    "title": "Portfolio de Sophie Bluel",
    "description": "Création d'un portfolio pour une architecte d'intérieur",
    "image": { "src":"/images/Sophie-bluel-logo.webp", "alt":"Logo de Sophie Bluel"},
    "project_id": "projet-2",
    "details": {
      "pictures": [
        { "src": "/images/Sophie-bluel-home.webp" , "alt": "Page d'accueil de Sophie Bluel" },
        { "src": "/images/Sophie-bluel-login.webp", "alt": "Page de connexion de Sophie Bluel" },
        { "src": "/images/Sophie-bluel-admin.webp", "alt": "Page admin de Sophie Bluel" }
      ],
      "scenario":"En tant que développeur front-end, j’ai intégré une équipe travaillant sur le site portfolio d’une architecte d’intérieur. Après avoir reçu le design Figma, le code back-end et la base front-end statique, ma mission était de transformer cette version initiale en un site interactif et fonctionnel. J’ai été responsable du développement de la galerie des projets, de la création complète de la page de connexion administrateur et de la modale permettant d’ajouter de nouveaux médias.",
      "roles":[
        "Développer la page de présentation des travaux de l'architecte.",
        "Créer la page de connexion administrateur avec gestion des tokens.",
        "Développer une modale accessible pour l’upload de médias (images).",
        "Intégrer les maquettes Figma en responsive design.",
        "Collaborer avec l’équipe via le Kanban et assurer la cohérence du projet."
      ],
      "features": [
        "Galerie dynamique filtrable par catégorie.",
        "Page de connexion sécurisée pour l’administrateur.",
        "Stockage du token d’authentification en localStorage.",
        "Modale permettant d’ajouter de nouveaux médias avec prévisualisation."
      ],
      "technologies": [
        "JavaScript (ES6+)",
        "HTML5 / CSS3",
        "LocalStorage",
        "Figma"
      ], 
      "link": "https://github.com/corsarto/Portfolio-sophie-bluel.git"
    }
  },
  {
    "id": 3,
    "title": "Booki",
    "description": "Création d'une interface pour un site de réservation d'hébergements et d'activité dans une ville ",
    "image": { "src":"/images/Booki-logo.webp", "alt": "Logo de Booki"},
    "project_id": "projet-3",
    "details":{
      "pictures": [
        { "src": "/images/Booki-desktop.webp" , "alt": "Booki en format desktop" },
        { "src": "/images/Booki-tablette.webp", "alt": "Booki version tablette" },
        { "src": "/images/Booki-mobil.webp", "alt": "Booki version mobile" }
      ],
      "scenario": "J’ai participé au développement du site permettant aux utilisateurs de rechercher des hébergements et des activités dans la ville de leur choix. Mon rôle principal était d’intégrer l’interface utilisateur à partir des maquettes Figma fournies par l'UI designer et validées par la CTO. J’ai travaillé sur l’intégration complète en HTML et CSS, en veillant à respecter le responsive design pour desktop, tablette et mobile, ainsi que les contraintes techniques définies dans la note de synthèse.",
      "roles": [
        "Analyser les maquettes Figma pour comprendre la structure et le design du site.",
        "Compléter le fichier HTML fourni pour intégrer les différentes sections du site.",
        "Développer la mise en page et le style en CSS en respectant la charte graphique.",
        "Assurer la compatibilité responsive sur desktop, tablette et mobile."
      ],
      "features": [
        "Page d’accueil présentant les hébergements et les activités d’une ville.",
        "Mise en page responsive adaptée à tous les supports.",
        "Respect strict des maquettes fournies (desktop, tablette, mobile).",
        "Structure de code organisée et conforme aux bonnes pratiques HTML/CSS.",
        "Intégration accessible et optimisée pour l’expérience utilisateur."
      ],
      "technologies": [
        "HTML5",
        "CSS3 (Flexbox, responsive design)",
        "Figma"
      ], 
      "link": "https://github.com/corsarto/Booki.git"
    }
  },
  {
    "id": 4,
    "title": "Mon vieux grimoire",
    "description": "Création d'un serveur et d'une base de données pour une librairie",
    "image": { "src":"/images/Vieux-grimoire-logo.webp", "alt": "Logo de Mon vieux grimoire"},
    "project_id": "projet-4",
    "details": {
      "pictures": [
        { "src": "/images/Vieux-grimoire-home.webp" , "alt": "Page d'acueil de Mon Vieux Grimoire" },
        { "src": "/images/Vieux-grimoire-books.webp", "alt": "Page d'un livre dans Mon Vieux Grimoire" },
        { "src": "/images/Vieux-grimoire-modifier.webp", "alt": "Page de modification d'un livre" }
      ], 
      "scenario": "En tant que développeur back-end freelance, j’ai collaboré avec Kévin, un développeur front-end expérimenté, sur le projet Mon Vieux Grimoire : un site de référencement et de notation de livres pour une chaîne de librairies locales. Tandis que Kévin s’occupait du front-end en React, ma mission était de concevoir et développer toute la partie back-end. J’ai mis en place une API REST sécurisée permettant de gérer l’ajout de nouveaux livres, le système de notation par les utilisateurs et la persistance des données. J’ai également intégré un système d’optimisation des images pour répondre aux bonnes pratiques de Green Code, tout en assurant la conformité aux spécifications fonctionnelles et techniques transmises par le client.",
      "roles": [
        "Analyser les spécifications fonctionnelles et techniques fournies par le client.",
        "Mettre en place l’API REST pour la gestion des livres et des notations.",
        "Implémenter l’authentification sécurisée des utilisateurs.",
        "Développer les routes CRUD pour les livres et les avis.",
        "Optimiser et compresser les images uploadées par les utilisateurs (Green Code).",
        "Assurer la communication fluide entre le front-end React et le back-end."
      ],
      "features": [
        "Ajout d’un nouveau livre avec titre, auteur, image et description.",
        "Notation des livres par les membres avec calcul de la moyenne visible publiquement.",
        "Gestion sécurisée de l’authentification et des permissions.",
        "Optimisation automatique des images uploadées (taille et poids réduits)."
      ], 
      "technologies": [
        "Node.js / Express",
        "MongoDB",
        "JWT (JSON Web Token) pour l’authentification",
        "Multer + Sharp (upload et optimisation des images)"
      ],
      "link": "https://github.com/corsarto/Mon-vieux-grimoire.git"
    }
  }
]
